slides/beginner/org/clojure-examples/syntax.org
#+Title: Introduction to clojure
#+Author: Evan Misshula
#+Email: emisshula@jjay.cuny.edu
#+Date: 2017-05

#+OPTIONS: H:2 toc:t num:t
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n) export(e)
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+STARTUP: beamer
#+EXPORT_SELECT_TAGS: export(e)
#+EXPORT_EXCLUDE_TAGS: noexport(n)
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presetation]
#+BEAMER_THEME: Madrid
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

* Why learn to code?
** Why you are here
- You will understand more about how the world around you works
- You might be able to get a job coding
- You will understand how to break big problems into smaller ones 
- You will eventually build websites and phone apps
* Why clojure?
** What is Clojure?
- Clojure is a hosted language that can compile to Java or Javascript
  which allows us to build rich web or phone apps that run in many
  environments.
- Clojure is a functional programming language which allows us to
  build complex solutions from simple ones.
- Clojure has immutable data structures which makes it easier to
  reason about programs and helps with performance
- We can change the state of the program through a series of immutable
  values over time
- Clojure evaluates programs using its own types allowing us to write
  programs that write programs
- Clojure has an elegant way of doing asynchronos programming which is
  necessary both for large data and uncertain execution environments
  like the web
* But first, we have to start small
** Walking before we run
- simple values
- booleans and nil
- keywords
- numbers and arithmetic
* Data structures
** our building blocks
- lists
- vectors
- maps
* Functions
** change the world
- What are functions?
- Functions that take other functions
- Predicate functions
- Anonymous functions
- Pure functions
* Building a project
** Clojure build tools
- Lennigen
- the REPL
- Namespaces
* The turtles project
** [[https://github.com/ClojureBridge/welcometoclojurebridge/blob/master/outline/TURTLE-SAMPLES.md][Imperative Programming through Turtles]]
- How to walk turtles
  - initial state
  - ~undo~, ~clean~ and ~home~
  - ~state~
  - ~doc~
** Movement
- Basic Movement - forward, backward right and left
- Multiple turtles
  - tilt
- Add one more turtle and give them commands
- Move all five turtles - Introduction to functions
  - ~map~ higher order functions
** Our first programs
- Write a function that adds turtles
- Functions with parameters
- control flow with ~if~ to check input
** variations on the theme 
- Functions with five turtles moving in different directions
  - use ~map~
  - use recursion
* reconsidering theory in light of turtles
** Data Structures revisited
+ Immutable state
+ Sequence and collection abstractions
+ Lists, vectors, and hash-maps
** controlled evaluation
+ Sequence functions
+ Key-value functions
+ Lazy evaluation
  
** Higher order functions

+ ~map~, ~reduce~, ~filter~, ~apply~, etc.
+ Solving problems functionally

* Our building blocks
** Base data types
- Numbers
#+BEGIN_SRC  clojure :results output
  '(12
   +12
   -100)
#+END_SRC

#+RESULTS:


#+begin_src clojure 
(println  (+ 9 1))
#+end_src

#+RESULTS:
: Done!

#+begin_src clojure :results value
  [1 2 3 4]
#+end_src

#+RESULTS:
: Done!

** Keywords
- *Keywords* are special words that name a part of a complicated data
  structure. They are clojures fast way to get to the data we need
#+BEGIN_EXAMPLE
:foobar
:2
:?
#+END_EXAMPLE

** Symbols
- *Symbols* evaluate to functions or variables
#+BEGIN_EXAMPLE
sample-symbol
f1
swap!
#+END_EXAMPLE

** Strings
- *Strings* are ordered collections of characters. We denote a string
  by putting it in double quotes

#+BEGIN_SRC clojure :results output
(print "Hi Evan")
#+END_SRC

#+RESULTS:
: Done!

** Characters 
- *Characters* are also a type. A character is just a single letter
- it has a backslash in front of it.

** Arithmetic in Clojure
- Computers were first used to do large arithmetic calculations.  
- Clojure uses *prefix notation* which means the operation is at the beginning
#+BEGIN_EXAMPLE
(+ 1 3) 
;;NOT (1 + 3)
#+END_EXAMPLE

** Clojure has namespaces
- A namespace is a container that makes it easier to create unique
  names for functions and symbols

#+BEGIN_SRC clojure :results silent exports code
radio/change station
clojure.core/- 
#+END_SRC

** Compound data 
- Strings put individual characters together but we will want to put
  numbers and letters together.  Clojure has several compund data
  structures.

  1. a list '(1 2 3 4)

  2. a vector [1 2 3 4]

  3. a set which has only unique elements #{1 2 3}

  4. a map {:evan 1, :ray 3, :jeff 2} which maps names to values. In
     other languages this is called an associative array or a hash-map.

** Clojure is functional

- Clojure is a functional language.  In practical terms this means
  that it accomplishes its work by dividing its tasks onto functions
  which transform data from input to output.  The next few slides will
  help us understand how to read and write our own functions.

- ~defn~ defines a named functions

#+BEGIN_SRC clojure :exports code
(defn greet [name] (str "Welcome, " name))
#+END_SRC

- Our functions name is greet
- It takes a single parameter 'name' 
- It does not return anything, only nil
- It prints which is considered a side effect

** Multi-arity
- A function can take different numbers of arguements 
- Functions must be defined with ~defn~
- Doing this twice replaces the function definition
  - Slow down! This is strange/weird
    - One arity c-a-n c-a-l-l a-n-o-t-h-e-r

#+BEGIN_SRC clojure :results silent :exports code
  (defn myGreeterWdefault
    ([]     (myGreeterWdefault "Where's lunch?"))
    ([msg]  (println msg)))
#+END_SRC

** Variadic Functions
- /Variadic/ functions have an undefined number of parameters which
  are collected into a sequnce and used by the function. The ampersand
  ~&~ does not appear when you call the function.
- The collected arguements come after a '&'

#+BEGIN_SRC clojure :results silent :exports code
(defn myGreetingWdefault [greeting & who]
  (println greeting who))
#+END_SRC

#+BEGIN_SRC clojure :results silent :exports code
(hello "Hello" "world" "class")
#+END_SRC
** Anonymous functions
- /Anonymous/ functions can be created and called for a single purpose
- can be defined with ~fn~ or ~#()~

- So:
#+BEGIN_SRC clojure :results silent :exports code
  (=
   (fn [x y] (+ x y))
   #(+ %1 %2))
#+END_SRC

** Anonymous and variadic
- These functions can be expressed as 

#+BEGIN_SRC clojure :results silent :exports code
  (=
   (fn [x y & zs] (println x y zs))
   #(println %1 %2 %&)
  )
#+END_SRC
** Pure functions in Clojure
- /Side Effects/ are ways in which the your program interacts with the
  outside world such as printing or writitng to and reading from disk.
  These are necessary but it is impossible to know if they will
  succeed.
- /Pure/ functions are ones that just return a value and have no side effects.
